<?php

/*
 * helpers - помошники, их можно вызывать откуда угодно
 * без подключения классов
 * их очень много
 */

/* Те, которые я использую*/

 
/* auth() - проверяет, авторизирован ли пользователь */

$user = auth()->user(); 

//////////////////////////////////////////////

/* Вернёт на предыдущую страницу*/
back();

//////////////////////////////////////////////

/* collect - создаст коллекцию, 
 * а для коллекций, очень 
 * много методов, которые ускоряют разработку
 */

 $collection = collect(['taylor', 'abigail']); 
 
 ////////////////////////////////////////////////
 
 /* Это надо обязательно добавлять при отправке форм*/
 
 csrf_field();
 
 /////////////////////////////////////////////////////////
 
 /* Самая частоиспользуемая функция, для просмотра данных*/

dd();


/*То же самое, только работа не прекращается*/

dump();

/////////////////////////////////////////////////////////////

/* old - подставляет старое значение в форму, 
 * если форма была отправлена
 */

 $value = old('value'); 
 $value = old('value', 'default'); 
 
 
 //////////////////////////////////////
 
 /* redirect - перенапрвляет, на указанную страницу*/

 redirect('/');
 
 /////////////////////////////////////
 
 
 /* request возвращает текущий экземпляр запроса */
 
 $request = request(); 
 $value = request('key', $default); 
 
 //////////////////////////////////////
 
 /* view - возвращает экземпляр вида*/
 
  return view('auth.login'); // папка auth, файл login.blade.php
  
  
 
