<?php

/* Collections - коллекции*/

/*
 * коллекции это класс для работы с массивами
 */

/* часто использованнык методы*/

Метод all возвращает базовый массив, представленный коллекцией:

 collect([1, 2, 3])->all(); // [1, 2, 3] 
 
 ////////////////////////////////////////////////////////
 
 Средство avg возвращает среднее значение данного ключа:
 
 $average = collect([1, 1, 2, 4])->avg(); // 2
 
 ///////////////////////////////////////////////////////////
 
 each метод выполняет итерацию по элементам коллекции и передает 
 каждому элементу обратный вызов:

 $collection->each(function ($item, $key) { // })   
     
 }
 //////////////////////////////////////////////////////////////
